# Basic Data Processing with Pandas

In [1]:
import pandas as pd

In [10]:
# list of strings
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [11]:
# list of numbers
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [12]:
# list of strings with None
animals = ['Tiger', 'Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [13]:
# list of numbers with None
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [14]:
# NaN
import numpy as np
np.nan == None

False

In [15]:
np.isnan(np.nan)

True

In [23]:
# labeled data instead of index
sports = {
    'Archery': 'Bhutan',
    'Golf': 'Scotland',
    'Sumo': 'Japan',
    'Taekwondo': 'South Korea'
}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [24]:
# get index
s.index

Index([u'Archery', u'Golf', u'Sumo', u'Taekwondo'], dtype='object')

In [26]:
# set index
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

## Querying a Series

In [28]:
sports = {
    'Archery': 'Bhutan',
    'Golf': 'Scotland',
    'Sumo': 'Japan',
    'Taekwondo': 'South Korea'
}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [31]:
s.iloc[3]

'South Korea'

In [32]:
s.loc['Golf']

'Scotland'

In [33]:
s['Golf']

'Scotland'

In [34]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [35]:
# get total (slow)
total = 0
for item in s:
    total += item
print(total)

324.0

In [37]:
# get total using numpy (fast)
import numpy as np

total = np.sum(s)
print(total)

324.0

In [41]:
# speed tests on larger dataset
s = pd.Series(np.random.randint(0, 1000, 10000))

# show top 5
s.head()

0    750
1     23
2    678
3    492
4    637
dtype: int64

In [42]:
len(s)

10000

In [43]:
%%timeit -n 100
summary = 0
for item in s:
    summary += item

100 loops, best of 3: 2.11 ms per loop

In [44]:
%%timeit -n 100
summary = np.sum(s)

100 loops, best of 3: 35.6 Âµs per loop

In [45]:
s += 2
s.head()

0    752
1     25
2    680
3    494
4    639
dtype: int64

In [46]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 10000))

for label, value in s.iteritems():
    s.loc[label] = value + 2

10 loops, best of 3: 907 ms per loop

In [47]:
%%timeit -n 10
s = pd.Series(np.random.randint(0, 1000, 10000))
s += 2

10 loops, best of 3: 476 Âµs per loop

In [48]:
# add item to series
s = pd.Series([1, 2, 3])

s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

## The DataFrame Data Structure

In [83]:
import pandas as pd

In [84]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item': 'Kitten Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 1', 'Store 2'])
df.head()

         Cost           Item   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5  Kitten Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [85]:
df.loc['Store 2']

Cost            5
Item    Bird Seed
Name        Vinod
Name: Store 2, dtype: object

In [86]:
df.loc['Store 1']

         Cost           Item   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5  Kitten Litter  Kevyn

In [87]:
# get a column
df['Item']

Store 1         Dog Food
Store 1    Kitten Litter
Store 2        Bird Seed
Name: Item, dtype: object

In [88]:
# get all rows from two columns
df.loc[:, ['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [89]:
# drop
df.drop('Store 1')

         Cost       Item   Name
Store 2   5.0  Bird Seed  Vinod

In [90]:
df

         Cost           Item   Name
Store 1  22.5       Dog Food  Chris
Store 1   2.5  Kitten Litter  Kevyn
Store 2   5.0      Bird Seed  Vinod

In [91]:
# permanent drop
df_copy = df.copy()
df_copy = df_copy.drop('Store 1')

df_copy

         Cost       Item   Name
Store 2   5.0  Bird Seed  Vinod

In [92]:
# adding data to dataframe
df['Location'] = None
df

         Cost           Item   Name Location
Store 1  22.5       Dog Food  Chris     None
Store 1   2.5  Kitten Litter  Kevyn     None
Store 2   5.0      Bird Seed  Vinod     None

In [93]:
# deleting data from dataframe
del df_copy['Name']
df_copy

         Cost       Item
Store 2   5.0  Bird Seed

In [94]:
# example: apply discount
df['Cost'] *= 0.8
df

         Cost           Item   Name Location
Store 1  18.0       Dog Food  Chris     None
Store 1   2.0  Kitten Litter  Kevyn     None
Store 2   4.0      Bird Seed  Vinod     None

## DataFrame Indexing and Loading

In [108]:
costs = df['Cost'].copy()
costs

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [109]:
costs +=2 # broadcasting
costs

Store 1    20.0
Store 1     4.0
Store 2     6.0
Name: Cost, dtype: float64

In [110]:
df

         Cost           Item   Name Location
Store 1  18.0       Dog Food  Chris     None
Store 1   2.0  Kitten Litter  Kevyn     None
Store 2   4.0      Bird Seed  Vinod     None

In [114]:
# load from system
!cat 'data.csv'

ISO country code,Country name,2011 GDP,2010 population,Female count,Male count,Gold medals,Silver medals,Bronze medals
USA,US,15094000000000.00,309349000,271,260,46,29,29
CHN,China,7298100000000.00,1338300000,208,163,38,27,23
JPN,Japan,5867150000000.00,127451000,162,141,7,14,17
DEU,Germany,3570560000000.00,81777000,176,219,11,19,14
FRA,France,2773030000000.00,64895000,148,187,11,11,12
BRA,Brazil,2476650000000.00,194946000,128,138,3,5,9
GBR,UK,2431590000000.00,62232000,269,287,29,17,19
ITA,Italy,2194750000000.00,60483000,122,159,8,9,11
RUS,Russia,1857770000000.00,141750000,227,208,24,26,32
IND,India,1847980000000.00,1224615000,23,60,0,2,4
JAM,Jamaica,15069767442.00,2702000,25,25,4,4,4
GEO,Georgia,14366566609.00,4452000,6,29,1,3,3
PRK,North Korea,12280000000.00,24589122,40,15,4,0,2
ARM,Armenia,10247788877.00,3092000,4,21,0,1,2
MNG,Mongolia,8557529910.00,2756000,13,16,0,2,3
BHS,Bahamas,7787514000.00,343000,11,15,1,0,0
MDA,Moldova,7000318677.00,3562000,10,12,0,0,2
TJK,Tajikistan,6522200291.00,6879000,3,13,0,0,1
MNE,Montenegro,4550463278.00,632000,16,18,0,1,0
GRD,Grenada,816054092.20,104000,4,6,1,0,0

In [127]:
df = pd.read_csv('data.csv')
df.head()

,ISO country code,Country name,2011 GDP,2010 population,Female count,Male count,Gold medals,Silver medals,Bronze medals
0,USA,US,1.509400e+13,309349000,271,260,46,29,29
1,CHN,China,7.298100e+12,1338300000,208,163,38,27,23
2,JPN,Japan,5.867150e+12,127451000,162,141,7,14,17
3,DEU,Germany,3.570560e+12,81777000,176,219,11,19,14
4,FRA,France,2.773030e+12,64895000,148,187,11,11,12

In [128]:
# rename labels
df.rename(columns={'ISO country code': 'ISO', 'Country name': 'Country', 'Female count': 'Female', 'Male count': 'Male', 'Gold medals': 'Gold', 'Silver medals': 'Silver', 'Bronze medals': 'Bronze'}, inplace=True)
df

,ISO,Country,2011 GDP,2010 population,Female,Male,Gold,Silver,Bronze
0,USA,US,1.509400e+13,309349000,271,260,46,29,29
1,CHN,China,7.298100e+12,1338300000,208,163,38,27,23
2,JPN,Japan,5.867150e+12,127451000,162,141,7,14,17
3,DEU,Germany,3.570560e+12,81777000,176,219,11,19,14
4,FRA,France,2.773030e+12,64895000,148,187,11,11,12
5,BRA,Brazil,2.476650e+12,194946000,128,138,3,5,9
6,GBR,UK,2.431590e+12,62232000,269,287,29,17,19
7,ITA,Italy,2.194750e+12,60483000,122,159,8,9,11
8,RUS,Russia,1.857770e+12,141750000,227,208,24,26,32
9,IND,India,1.847980e+12,1224615000,23,60,0,2,4
10,JAM,Jamaica,1.506977e+10,2702000,25,25,4,4,4
11,GEO,Georgia,1.436657e+10,4452000,6,29,1,3,3
12,PRK,North Korea,1.228000e+10,24589122,40,15,4,0,2
13,ARM,Armenia,1.024779e+10,3092000,4,21,0,1,2
14,MNG,Mongolia,8.557530e+09,2756000,13,16,0,2,3
15,BHS,Bahamas,7.787514e+09,343000,11,15,1,0,0
16,MDA,Moldova,7.000319e+09,3562000,10,12,0,0,2
17,TJK,Tajikistan,6.522200e+09,6879000,3,13,0,0,1
18,MNE,Montenegro,4.550463e+09,632000,16,18,0,1,0
19,GRD,Grenada,8.160541e+08,104000,4,6,1,0,0

In [129]:
# delete GDP and population
del df['2011 GDP']
del df['2010 population']
df

    ISO      Country  Female  Male  Gold  Silver  Bronze
0   USA           US     271   260    46      29      29
1   CHN        China     208   163    38      27      23
2   JPN        Japan     162   141     7      14      17
3   DEU      Germany     176   219    11      19      14
4   FRA       France     148   187    11      11      12
5   BRA       Brazil     128   138     3       5       9
6   GBR           UK     269   287    29      17      19
7   ITA        Italy     122   159     8       9      11
8   RUS       Russia     227   208    24      26      32
9   IND        India      23    60     0       2       4
10  JAM      Jamaica      25    25     4       4       4
11  GEO      Georgia       6    29     1       3       3
12  PRK  North Korea      40    15     4       0       2
13  ARM      Armenia       4    21     0       1       2
14  MNG     Mongolia      13    16     0       2       3
15  BHS      Bahamas      11    15     1       0       0
16  MDA      Moldova      10    12     0       0       2
17  TJK   Tajikistan       3    13     0       0       1
18  MNE   Montenegro      16    18     0       1       0
19  GRD      Grenada       4     6     1       0       0